{
  "provider": "ZenML GmbH",
  "description": "Demo Credit Scoring AI system",
  "intended_purpose": "Assign a credit-risk score to loan applicants.",
  "additional_interactions": "Integrates with banking CRM systems for customer data extraction and loan decision workflows. The system also connects to credit bureau APIs to obtain applicants' credit history.",
  "design_assumptions": "We assume complete financial history, stable macroeconomy.",
  "compliance_tradeoffs": "We reduced model complexity to improve explainability, which slightly reduced accuracy but significantly improved transparency in decision-making as required by the EU AI Act.",
  "hardware_requirements": "2 vCPU, 8 GB RAM, 10 GB disk",
  "computational_resources": "Training requires 8 vCPU, 32 GB RAM, and GPU acceleration. Inference runs on standard 2 vCPU, 8 GB RAM instances.",
  "data_methodology": "Data is selected from a balanced historical loan dataset spanning 5 years. Sensitive attributes are removed or anonymized during preprocessing. Labels are derived from actual loan outcomes with a 24-month performance window.",
  "bias_mitigation": "We implemented post-processing techniques to minimize gender and age bias. Protected attributes are excluded from the model's training data, and we apply fairness constraints during prediction.",
  "oversight_assessment": "Human oversight is implemented through a mandatory approval workflow before any model deployment. The system flags potentially biased predictions for human review.",
  "continuous_compliance_plan": "The system continuously monitors fairness metrics and performance. Automated retraining is triggered if drift is detected, with a quarterly schedule for full compliance reassessment.",
  "cybersec_measures": "The model and data are secured using access controls, encryption at rest and in transit, regular security scanning, and vulnerability assessment of the deployment infrastructure.",
  "limitations": "The system may have lower accuracy for applicants with limited credit history. It should not be used as the sole determining factor for loan approvals.",
  "unintended_outcomes": "The system may inadvertently perpetuate historical biases present in the training data. There is also a risk of creating a feedback loop where individuals denied credit cannot build credit history.",
  "input_specifications": "The system requires a minimum set of applicant data including income, employment history, existing debt, payment history, and credit score. All numerical inputs should be normalized and categorical variables encoded according to the documented schema.",
  "metric_appropriateness": "We selected AUC, precision, and recall as primary metrics based on the business need to balance risk with opportunity. Fairness metrics include demographic parity and equal opportunity difference to ensure equitable outcomes across protected groups.",
  "standards_list": "ISO/IEC 27001:2022 for information security, IEEE 7010-2020 for algorithmic impact assessment, and CEN Workshop Agreement 17145-1 for validation methodologies.",
  "post_market_plan": "We monitor model performance daily with automated alerting for drift detection. User feedback is collected through a structured feedback API and quarterly audits are conducted to assess overall system impact.",
  "product_image_url": "https://example.com/images/credit-scoring-system.png",
  "ui_screenshot_url": "https://example.com/images/dashboard-screenshot.png",
  "user_doc_link": "https://docs.example.com/credit-scoring-system",
  "arch_diagram_url": "https://example.com/images/system-architecture.png",
  "declaration_file": "https://compliance.example.com/eu-declaration-of-conformity.pdf"
}
